package nickname

import (
	"math/rand"
	"strings"
	"time"
	"unicode"
)

var female = []rune("ая")
var neuter = []rune("ое")

var adjectives = []string{"Абрикосовый", "Агатовый", "Аквамариновый", "Акриловый", "Алый", "Амарантовый", "Аметистовый", "Латунный", "Антрацитовый", "Арлекиновый", "Аспидный", "Базальтовый", "Баклажановый", "Барвиноковый", "Бежевый", "Алюминиевый", "Багряный", "Бело-зеленый", "Белоснежный", "Белый", "Берлинский", "Лазурный", "Бирюзовый", "Бисквитный", "Бисмарковый", "Бледный", "Блестящий", "Бобровый", "Болгарский", "Болотный", "Бордовый", "Брезентовый", "Бриллиантовый", "Бронзовый", "Бургундский", "Бурый", "Ванильный", "Васильковый", "Вердепешевый", "Вердепомовый", "Вересковый", "Бутонный", "Византийский", "Черничный", "Винтовочный", "Вишневый", "Оливковый", "Радужный", "Галечный", "Гейнсборный", "елиотропный", "Георгиновый", "Глиняный", "Голубинный", "Грозовой", "Голубой", "Горечавковый", "Луговой", "Небесный", "Горчичный", "Горький", "Гранатовый", "Гранитовый", "Графитный", "Графитовый", "Гридеперлевый", "Грузинский", "Грушевый", "Гуммигутовый", "Гусеничный", "Дартмутский", "Джинсовый", "Клубничный", "Арбузный", "Дымчатый", "Дынный", "Железный", "Серный", "Слоновый", "Смородиновый", "Персиковый", "Золотой", "Ракитниковый", "Жемчужный", "Жженый", "Жимолостный", "Звездный", "Сосновый", "Зеленый", "Коричневый", "Лаймовый", "Черный", "Темный", "Сумеречный", "Зеленоватый", "Асфальтовый", "Лишайниковый", "Мшистый", "Папоротниковый", "Трилистниковый", "Тропный", "Чайный", "Золотарниковый", "Березовый", "Каштановый", "Ивовый", "Дорожный", "Путевой", "Известковый", "Изумрудный", "Индийский", "Ирландский", "Июньский", "Кадетский", "Камелопардовый", "Каменный", "Канареечный", "Кардинальный", "Карибский", "Карминовый", "Кварцевый", "Киноварный", "Кирпичный", "Китайский", "Кленовый", "Кобальтовый", "Буйвольный", "Апельсиновый", "Коралловый", "Кордованский", "Коричневатый", "Коричный", "Королевский", "Космический", "Кофейный", "Крайоловый", "Красный", "Кремовый", "Кукурузный", "Лавандовый", "Лазерный", "Лаймовый", "Ламантиновый", "Латунный", "Волчий", "Лесной", "Ливерный", "Лиловый", "Лимонный", "Лиственный", "Лососевый", "Льняной", "Люминесцентный", "Лягушковый", "Мятный", "Магнолиевый", "Маджентовый", "Маисовый", "Майский", "Малахитовый", "Малиновый", "Мальвовый", "Манговый", "Мандариновый", "Маренговый", "Марсаловый", "Махагоновый", "Медный", "Медовый", "Миндальный", "Миртовый", "Мовеиновый", "Фуксиевый", "Мокасиновый", "Тропический", "Морковный", "Потухший", "Пожухлый", "Угасший", "Морской", "Муреновый", "Мышинный", "Нарциссовый", "Умбронный", "Неоновый", "Ночной", "Обычный", "Огненный", "Одуванчиковый", "Океанский", "Оксидовый", "Озерный", "Речной", "Опаловый", "Оранжевый", "Ореховый", "Ориентовый", "Орхидейный", "Отборный", "Отдаленный", "Охотничий", "Охрянный", "Пангонный", "Пастельный", "Патиновый", "Полевой", "Перламутровый", "Персидский", "Перуанский", "Песочный", "Пигментный", "Пихтовый", "Пламенный", "Платиновый", "Полуночный", "Закатный", "Рассветный", "Полуденный", "Призрачный", "Пшеничный", "Пыльный", "Пюсовый", "Рапсовый", "Резедовый", "Ржавый", "Розоватый", "Долинный", "Эбонитовый", "Розовый", "Щербетный", "Рыжий", "Салатовый", "Сангинный", "Сапфировый", "Светлый", "Стальной", "Селадонный", "Сепиевый", "Серебристый", "Серебряный", "Фиолетовый", "Бетонный", "Нейтральный", "Добрый", "Хаотичный", "Шелковый", "Аспидный", "Шиферный", "Сигнальный", "Сиенный", "Сизый", "Синеватый", "Сиреневый", "Сияющий", "Скарлетный", "Сланцевый", "Сливовый", "Сливочный", "Слоновый", "Снежный", "Солнечный", "Лунный", "Сомонный", "Карминный", "Старинный", "Старый", "Телегрейный", "Телемагентный", "Янтарный", "Терракотный", "Терракотовый", "Тициановый", "Томатный", "Утренний", "Травяной", "Турецкий", "Тусклый", "Тыквенный", "Фалунский", "Фанданговый", "Фиалковый", "Фисташковый", "Французский", "Хромовый", "Цветной", "Пестрый", "Приметный", "Цветочный", "Цементный", "Цинковый", "Черноватый", "Шамуанный", "Шартрезный", "Шафрановый", "Шоколадный", "Экрюнный", "Яркий", "Ягодный", "Элклерный", "Эфирный"}
var nouns = []string{"Абрикос", "Агератум", "Агростемма", "Адиантум", "Адонис", "Азарина", "Азорелла", "Аир", "Аквилегия", "Аконит", "Актинидия", "Алиссум", "Алтея", "Альтернантера", "Амарант", "Аморфа", "Амсония", "Анагаллис", "Ветренница", "Аралия", "Аризема", "Астра", "Ацена", "Гладиолус", "Багрянник", "Багульник", "Бадан", "Бальзамин", "Барбарис", "Барвинок", "Бегония", "Белоцветник", "Береза", "Бересклет", "Боярышник", "Брандушка", "Бруннера", "Брусника", "Бубенчик", "Буддлея", "Бузина", "Буквица", "Бухарник", "Валериана", "Василек", "Вейгела", "Вербейник", "Вербена", "Вереск", "Весенник", "Вечерница", "Виноград", "Вишня", "Волжанка", "Воронец", "Вьюнок", "Вяз", "Гвоздика", "Гелениум", "Гелиотроп", "Георгина", "Солидаго", "Гиацинт", "Годеция", "Голубика", "Груша", "Дербенник", "Дрок", "Дуб", "Ежевика", "Фикус", "Жимолость", "Зверобой", "Зеленчук", "Земляника", "Золотарник", "Иксия", "Ирис", "Календула", "Калина", "Калужница", "Кедр", "Кизильник", "Кислица", "Клен", "Клюква", "Ковыль", "Колеус", "Колокольчик", "Кольквиция", "Коровяк", "Костенец", "Крокус", "Крыжовник", "Лаванда", "Ландыш", "Лен", "Лилия", "Липа", "Лиственница", "Лук", "Лунник", "Люпин", "Лютик", "Магнолия", "Мак", "Малина", "Маргаритка", "Медуница", "Меконопсис", "Миндаль", "Мирабилис", "Миррис", "Михения", "Многорядник", "Можжевельник", "Молочай", "Мята", "Нарцисс", "Настурция", "Незабудка", "Облепиха", "Орех", "Орляк", "Осмунда", "Осока", "Очиток", "Падуб", "Перец", "Перилла", "Петуния", "Печеночница", "Пион", "Пиретрум", "Пихта", "Подснежник", "Подсолнечник", "Полевичка", "Солодка", "Примула", "Принсепия", "Пролеска", "Прострел", "Ракитник", "Ревень", "Рябина", "Самшит", "Сеслерия", "Хвощ", "Ситник", "Скабиоза", "Скополия", "Слива", "Смородина", "Солнечник", "Солнцецвет", "Сосна", "Спирея", "Стахис", "Сумах", "Табак", "Тимьян", "Тисс", "Тополь", "Туя", "Тыква", "Тысячелистник", "Тюльпан", "Фиалка", "Физалис", "Флокс", "Форзиция", "Фрезия", "Хелона", "Хеномелес", "Хмель", "Хризантема", "Целозия", "Церцис", "Цикламен", "Цимицифуга", "Цинерария", "Цинния", "Черемуха", "Черника", "Черноголовка ", "Чина", "Чубушник", "Шалфей", "Шелковица", "Щетинник", "Щитовник", "Эдельвейс", "Элеутерококк", "Эндимион", "Энотера", "Эремуру", "Эхинацея", "Яблоня", "Ясенец", "Ясень", "Ясколка", "Ясменник", "Яснотка", "Ячмень", "Акация", "Акант", "Азалия", "Аконит", "Амброзия", "Репейник", "Миндаль", "Василёк", "Ангрекум", "Бальзамин", "Орхидея", "Лядвенец", "Камыш", "Колокольчик", "Гвоздика", "Чистотел", "Каштан", "Хризантема", "Кореопсис", "Примула", "Клевер", "Кориандр", "Георгин", "Маргаритка", "Одуванчик", "Бузина", "Фенхель", "Незабудка", "Чертополох", "Утёсник", "Трава", "Гелиотроп", "Гибискус", "Штокроза", "Эстрагон", "Молодило", "Гортензия", "Плющ", "Нарцисс", "Калина", "Лишайник", "Белозор", "Бессмертик", "Брусника", "Голубика", "Буквица", "Валериана", "Вьюнок", "Гравилат", "Девясил", "Дымянка", "Жостер", "Зимолюбка", "Розга", "Иван-чай", "Истод", "Костяника", "Крушина", "Купена", "Лабазник", "Латук", "Лук", "Манжетка", "Морошка", "Мыльнянка", "Норичник", "Облепиха", "Первоцвет", "Пижма", "Плаун", "Пырей", "Сабельник", "Сфагнум", "Таволга", "Арбуз", "Маракуйя", "Бенинказа", "Фискус", "Бриония", "Гамамелис", "Гидрастис", "Гринделия", "Десмодиум", "Донник", "Зюзник", "Иссоп", "Калуфер", "Кизил", "Карамбола", "Любисток", "Мачок", "Монарда", "Настурция", "Ольха", "Сальвия"}

var adjectiveEndings = []string{"ый", "ий", "ой"}

// Generate generates cyrillic nickname consisting of adjective6 and noun
func Generate(maxLength int) string {
	rand.Seed(time.Now().UnixNano())
	adjective := randomAdjective()
	noun := lowercaseFirstLetter(randomNoun())
	lastNounRune := []rune(noun)[len([]rune(noun))-1]

	// Check female noun
	if runeInSlice(lastNounRune, female) {
		for _, ending := range adjectiveEndings {
			adjective = strings.ReplaceAll(adjective, ending, "ая")
		}
	}
	// Check neuter noun
	if runeInSlice(lastNounRune, neuter) {
		for _, ending := range adjectiveEndings {
			adjective = strings.ReplaceAll(adjective, ending, "ое")
		}
	}

	resp := adjective + " " + noun
	if len(resp) > maxLength {
		return Generate(maxLength)
	}

	return resp
}

func lowercaseFirstLetter(word string) string {
	a := []rune(word)
	a[0] = unicode.ToLower(a[0])
	return string(a)
}

func randomNoun() string {
	return nouns[rand.Intn(len(nouns)-1)]
}

func randomAdjective() string {
	return adjectives[rand.Intn(len(adjectives)-1)]
}

func runeInSlice(a rune, list []rune) bool {
	for _, b := range list {
		if b == a {
			return true
		}
	}
	return false
}
